Revit 2027 API
View.GetPointCloudOverrides Method
 Returns point cloud overrides object for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointCloudOverrides GetPointCloudOverrides()
Public Function GetPointCloudOverrides As PointCloudOverrides
public:
PointCloudOverrides^ GetPointCloudOverrides()
member GetPointCloudOverrides : unit -> PointCloudOverrides
Return Value
PointCloudOverrides
 Point cloud overrides for the view
See Also
Reference
View Class
Autodesk.Revit.DB Namespace